package ru.otus.java.basic;

public class Application {
    /**
     * Домашнее задание:
     * 1. Заменить sout на логирование
     * 2. Реализовать обработку запроса DELETE /items?id=10 для удаления продукта с указанным ид
     * 3. * Модифицируйте метод GET /items: если пришел параметр запроса id, то надо вернуть
     * только продукт с указанным id (или 404 если такого продукта нет), в противном случае
     * все также возвращаем все продукты
     */

    public static void main(String[] args) {
        new HttpServer(8189).start();
    }
}